In [1]:
import duckdb
import pandas as pd

%load_ext sql
%config SqlMagic.autopandas = True
%config SqlMagic.feedback = False
%config SqlMagic.displaycon = False

%sql duckdb:///:default:

In [2]:
%%sql
create or replace table competencia_01 as 
select 
    *
from read_csv_auto('/Users/camillamassardi/Desktop/DMEyF/datasets/competencia_01_crudo.csv')

Empty DataFrame
Columns: [Success]
Index: []

In [3]:
%sql select * from competencia_01 limit 5

                                             column0
0  numero_de_cliente,foto_mes,active_quarter,clie...
1  29183981,202103,1,0,0,50,197,14468.81,125765.2...
2  29184630,202103,1,0,0,59,322,11901.57,74158.93...
3  29185433,202103,1,0,0,68,268,847.15,21672.47,4...
4  29185587,202103,1,0,0,79,322,4976.94,47735.98,...

In [5]:
 %%sql
CREATE OR REPLACE TABLE competencia_01_n AS
WITH max_mes AS (
    SELECT numero_de_cliente,
           MAX(foto_mes) AS max_foto_mes,
           MIN(foto_mes) AS min_foto_mes
    FROM competencia_01
    GROUP BY numero_de_cliente
    )
SELECT c.*,
       CASE
          WHEN m.min_foto_mes = 202103 THEN
              CASE 
                  WHEN m.max_foto_mes = 202103 THEN 'BAJA+1'
                  WHEN m.max_foto_mes = 202104 THEN 'BAJA+2'
                  WHEN m.max_foto_mes = 202105 THEN 'CONTINUA' 
              END
          WHEN m.min_foto_mes = 202104 THEN
              CASE 
                  WHEN m.max_foto_mes = 202105 THEN 'NA' 
                  WHEN m.max_foto_mes = 202104 THEN 'BAJA+1' 
              END
          ELSE 'NA'
       END AS clase_ternaria
FROM competencia_01 c
JOIN max_mes m USING (numero_de_cliente);

RuntimeError: If using snippets, you may pass the --with argument explicitly.
For more details please refer: https://jupysql.ploomber.io/en/latest/compose.html#with-argument


Original error message from DB driver:
(duckdb.BinderException) Binder Error: Referenced column "numero_de_cliente" not found in FROM clause!
Candidate bindings: "competencia_01.column0"
[SQL: CREATE OR REPLACE TABLE competencia_01_n AS
WITH max_mes AS (
   SELECT numero_de_cliente,
          MAX(foto_mes) AS max_foto_mes,
          MIN(foto_mes) AS min_foto_mes
   FROM competencia_01
   GROUP BY numero_de_cliente
   )
SELECT c.*,
      CASE
         WHEN m.min_foto_mes = 202103 THEN
             CASE
                 WHEN m.max_foto_mes = 202103 THEN 'BAJA+1'
                 WHEN m.max_foto_mes = 202104 THEN 'BAJA+2'
                 WHEN m.max_foto_mes = 202105 THEN 'CONTINUA'
             END
         WHEN m.min_foto_mes = 202104 THEN
             CASE
                 WHEN m.max_foto_mes = 202105 THEN 'NA'
                 WHEN m.max_foto_mes = 202104 THEN 'BAJA+1'
             END
         ELSE 'NA'
      END AS clase_ternaria
FROM competencia_01 c
JOIN max_mes m USING (numero_de_cliente);]
(Background on this error at: https://sqlalche.me/e/20/f405)

If you need help solving this issue, send us a message: https://ploomber.io/community

In [4]:
%%sql
CREATE OR REPLACE TABLE competencia_01_n AS
WITH max_mes AS (
    SELECT numero_de_cliente,
           MAX(foto_mes) AS max_foto_mes,
           MIN(foto_mes) AS min_foto_mes
    FROM competencia_01
    GROUP BY numero_de_cliente
    )
SELECT c.*,
       CASE
          WHEN m.min_foto_mes = 202103 THEN
              CASE 
                  WHEN m.max_foto_mes = 202103 THEN 'BAJA+1'
                  WHEN m.max_foto_mes = 202104 THEN 'BAJA+2'
                  WHEN m.max_foto_mes = 202105 THEN 'CONTINUA' 
              END
          WHEN m.min_foto_mes = 202104 THEN
              CASE 
                  WHEN m.max_foto_mes = 202105 THEN 'NA' 
                  WHEN m.max_foto_mes = 202104 THEN 'BAJA+1' 
              END
          ELSE 'NA'
       END AS clase_ternaria
FROM competencia_01 c
JOIN max_mes m USING (numero_de_cliente);

RuntimeError: If using snippets, you may pass the --with argument explicitly.
For more details please refer: https://jupysql.ploomber.io/en/latest/compose.html#with-argument


Original error message from DB driver:
(duckdb.BinderException) Binder Error: Referenced column "numero_de_cliente" not found in FROM clause!
Candidate bindings: "competencia_01.column0"
[SQL: CREATE OR REPLACE TABLE competencia_01_n AS
WITH max_mes AS (
    SELECT numero_de_cliente,
           MAX(foto_mes) AS max_foto_mes,
           MIN(foto_mes) AS min_foto_mes
    FROM competencia_01
    GROUP BY numero_de_cliente
    )
SELECT c.*,
       CASE
          WHEN m.min_foto_mes = 202103 THEN
              CASE
                  WHEN m.max_foto_mes = 202103 THEN 'BAJA+1'
                  WHEN m.max_foto_mes = 202104 THEN 'BAJA+2'
                  WHEN m.max_foto_mes = 202105 THEN 'CONTINUA'
              END
          WHEN m.min_foto_mes = 202104 THEN
              CASE
                  WHEN m.max_foto_mes = 202105 THEN 'NA'
                  WHEN m.max_foto_mes = 202104 THEN 'BAJA+1'
              END
          ELSE 'NA'
       END AS clase_ternaria
FROM competencia_01 c
JOIN max_mes m USING (numero_de_cliente);]
(Background on this error at: https://sqlalche.me/e/20/f405)

If you need help solving this issue, send us a message: https://ploomber.io/community

In [20]:
%%sql
SELECT clase_ternaria, COUNT(DISTINCT numero_de_cliente) AS cantidad_clientes
FROM competencia_01_n
GROUP BY clase_ternaria;

  clase_ternaria  cantidad_clientes
0       CONTINUA             161312
1             NA               2790
2         BAJA+2                963
3         BAJA+1               1055

In [21]:
%%sql
COPY competencia_01_n TO 'competencia_01.csv' (HEADER, DELIMITER ',');

Empty DataFrame
Columns: [Success]
Index: []